MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX534F064L.atdf
      <value-group caption="FIFO Size bits" name="C1FIFOCON22__FSIZE">
         <value caption="FIFO is 32 messages deep" name="" value="0x1f" />
         <value caption="FIFO is 3 messages deep" name="" value="0x2" />
         <value caption="FIFO is 2 messages deep" name="" value="0x1" />
         <value caption="FIFO is 1 message deep" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Empty Interrupt Flag bit" name="C1FIFOINT22__RXNEMPTYIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is at least half full" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is less than half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit" name="C1FIFOINT22__RXHALFIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not empty, has at least 1 message" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit" name="C1FIFOINT22__RXFULLIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is full" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C1FIFOINT22__RXOVFLIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has occurred" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit" name="C1FIFOINT22__TXEMPTYIF">
         <value caption="(TXEN is 1) FIFO is empty / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is not empty / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" name="C1FIFOINT22__TXHALFIF">
         <value caption="(TXEN is 1) FIFO is at most half full / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is more than half full / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit" name="C1FIFOINT22__TXNFULLIF">
         <value caption="(TXEN is 1) FIFO is not full / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is full / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C1FIFOINT22__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C1FIFOINT22__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C1FIFOINT22__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0" />
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C1FIFOINT22__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C1FIFOINT22__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C1FIFOINT22__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C1FIFOINT22__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C1FIFOCON23__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3" />
         <value caption="High Intermediate Message Priority" name="" value="0x2" />
         <value caption="Low Intermediate Message Priority" name="" value="0x1" />
         <value caption="Lowest Message Priority" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C1FIFOCON23__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1" />
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Send Request" name="C1FIFOCON23__TXREQ">
         <value caption="(TXEN is 1) Request sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent./ (TXEN is 0) This bit has no effect" name="" value="0x1" />
         <value caption="(TXEN is 1) Request a message abort / (TXEN is 0) This bit has no effect." name="" value="0x0" />
      </value-group>
      <value-group caption="Error Detected During Transmission bit" name="C1FIFOCON23__TXERR">
         <value caption="A bus error occurred while the message was being sent" name="" value="0x1" />
         <value caption="A bus error did not occur while the message was being sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Lost Arbitration bit" name="C1FIFOCON23__TXLARB">
         <value caption="Message lost arbitration while being sent" name="" value="0x1" />
         <value caption="Message did not lose arbitration while being sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Aborted bit" name="C1FIFOCON23__TXABAT">
         <value caption="Message was aborted" name="" value="0x1" />
         <value caption="Message completed successfully" name="" value="0x0" />
      </value-group>
