MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX534F064L.atdf
      <value-group caption="VBUS Charge Enable bit" name="U1OTGCON__VBUSCHG">
         <value caption="VBUS line is charged through a pull-up resistor" name="" value="0x1" />
         <value caption="VBUS line is not charged through a resistor" name="" value="0x0" />
      </value-group>
      <value-group caption="OTG Functionality Enable bit" name="U1OTGCON__OTGEN">
         <value caption="DPPULUP, DMPULUP, DPPULDWN and DMPULDWN bits are under software control" name="" value="0x1" />
         <value caption="DPPULUP, DMPULUP, DPPULDWN and DMPULDWN bits are under USB hardware control" name="" value="0x0" />
      </value-group>
      <value-group caption="VBUS Power-on bit" name="U1OTGCON__VBUSON">
         <value caption="VBUS line is powered" name="" value="0x1" />
         <value caption="VBUS line is not powered" name="" value="0x0" />
      </value-group>
      <value-group caption="D- Pull-Down Enable bit" name="U1OTGCON__DMPULDWN">
         <value caption="D- data line pull-down resistor is enabled" name="" value="0x1" />
         <value caption="D- data line pull-down resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D+ Pull-Down Enable bit" name="U1OTGCON__DPPULDWN">
         <value caption="D+ data line pull-down resistor is enabled" name="" value="0x1" />
         <value caption="D+ data line pull-down resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D- Pull-Up Enable bit" name="U1OTGCON__DMPULUP">
         <value caption="D- data line pull-up resistor is enabled" name="" value="0x1" />
         <value caption="D- data line pull-up resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="D+ Pull-Up Enable bit" name="U1OTGCON__DPPULUP">
         <value caption="D+ data line pull-up resistor is enabled" name="" value="0x1" />
         <value caption="D+ data line pull-up resistor is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Operation Enable bit" name="U1PWRC__USBPWR">
         <value caption="USB module is turned on" name="" value="0x1" />
         <value caption="USB module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Suspend Mode bit" name="U1PWRC__USUSPEND">
         <value caption="USB module is placed in Suspend mode" name="" value="0x1" />
         <value caption="USB module operates normally" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Module Busy bit" name="U1PWRC__USBBUSY">
         <value caption="USB module is active or disabled" name="" value="0x1" />
         <value caption="USB module is not active and is ready to be enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Sleep Entry Guard bit" name="U1PWRC__USLPGRD">
         <value caption="Sleep entry is blocked if USB bus activity is detected or if a notification is pending" name="" value="0x1" />
         <value caption="USB module does not block Sleep entry" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Activity Pending bit" name="U1PWRC__UACTPND">
         <value caption="USB bus activity has been detected; but an interrupt is pending" name="" value="0x1" />
         <value caption="An interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Error Condition Interrupt bit" name="U1IR__UERRIF">
         <value caption="Unmasked error condition has occurred" name="" value="0x1" />
         <value caption="Unmasked error condition has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="SOF Token Interrupt bit" name="U1IR__SOFIF">
         <value caption="SOF token received by the peripheral or the SOF threshold reached by the host" name="" value="0x1" />
         <value caption="SOF token was not received nor threshold reached" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Processing Complete Interrupt bit" name="U1IR__TRNIF">
         <value caption="Processing of current token is complete; a read of the U1STAT register will provide endpoint information" name="" value="0x1" />
         <value caption="Processing of current token not complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Idle Detect Interrupt bit" name="U1IR__IDLEIF">
         <value caption="Idle condition detected (constant Idle state of 3 ms or more)" name="" value="0x1" />
         <value caption="No Idle condition detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Resume Interrupt bit" name="U1IR__RESUMEIF">
         <value caption="K-State is observed on the D+ or D- pin for 2.5 usec" name="" value="0x1" />
         <value caption="K-State is not observed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Attach Interrupt bit" name="U1IR__ATTACHIF">
         <value caption="Peripheral attachment was detected by the USB module" name="" value="0x1" />
         <value caption="Peripheral attachment was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Interrupt bit" name="U1IR__STALLIF">
         <value caption="(In Host mode) a STALL handshake was received during the handshake phase of the transaction / (In Device mode) a STALL handshake was transmitted during the handshake phase of the transaction" name="" value="0x1" />
         <value caption="STALL handshake has not been sent" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Detach Interrupt bit (Host mode)" name="U1IR__DETACHIF">
         <value caption="Peripheral detachment was detected by the USB module" name="" value="0x1" />
         <value caption="Peripheral detachment was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Reset Interrupt bit (Device mode)" name="U1IR__URSTIF">
         <value caption="Valid USB Reset has occurred" name="" value="0x1" />
         <value caption="No USB Reset has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Error Interrupt Enable bit" name="U1IE__UERRIE">
         <value caption="USB Error interrupt is enabled" name="" value="0x1" />
         <value caption="USB Error interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SOF Token Interrupt Enable bit" name="U1IE__SOFIE">
         <value caption="SOFIF interrupt is enabled" name="" value="0x1" />
         <value caption="SOFIF interrupt is disabled" name="" value="0x0" />
      </value-group>
